; ModuleID = 'rsmain.19de4ef9-cgu.0'
source_filename = "rsmain.19de4ef9-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%0 = type { i64, { i8*, i8* } }
%1 = type { { [0 x i64]*, i64 }, i64 }
%2 = type { { i64*, i64* }, i64 }
%3 = type { i64, %4 }
%4 = type { { i64, i64 }, { i64, i64 }, i32, i32, i8, [7 x i8] }
%5 = type { { {}*, [3 x i64]* }, i8* }
%6 = type { { [0 x i8]*, i64 }, i64, i64, i64, i32, [4 x i8] }
%7 = type { i64, i64, i8, [7 x i8] }
%8 = type { %"core::fmt::Formatter"*, i64, i8, i8, [6 x i8] }
%9 = type { {}*, [2 x i64] }
%10 = type { {} }
%11 = type { i8*, i32, [1 x i32], i64 }
%12 = type { [7 x i64] }
%13 = type { i64, %14, i32, [1 x i32], i64* }
%14 = type { [16 x i64] }
%15 = type { i32, i16, i16 }
%16 = type { i64, [4 x i64] }
%17 = type { [19 x i64] }
%18 = type { [3 x i64] }
%19 = type { {}*, [5 x i64] }
%20 = type { { i8*, i64 }, i64 }
%21 = type { i64, [3 x i64] }
%22 = type { i64, [2 x i64] }
%23 = type { {}, %24 }
%24 = type { i64 }
%25 = type { i8, [15 x i8] }
%26 = type { { {}*, [3 x i64]* }, i8, [7 x i8] }
%27 = type { i32, i32, i32, [29 x i32], [0 x i64] }
%28 = type { i64, %20 }
%29 = type { [40 x i8] }
%30 = type { %24, %24, %31 }
%31 = type { { i8*, i64 }, i64, %32, [1 x i32] }
%32 = type { %33 }
%33 = type { i32 }
%34 = type { i64*, %34*, %35, [7 x i8] }
%35 = type { i8 }
%36 = type { { i64*, i64 }, i64 }
%37 = type { %22, i64* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<core::fmt::builders::PadAdapter as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::builders::PadAdapter as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !25, identifier: "a587abc0ff59b538a7eecb8f1b7f27bf")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "PadAdapter", scope: !15, file: !2, size: 192, align: 64, elements: !18, templateParams: !25, identifier: "4309c1a6a1350ca8ecbb5cbefd56fce")
!15 = !DINamespace(name: "builders", scope: !16)
!16 = !DINamespace(name: "fmt", scope: !17)
!17 = !DINamespace(name: "core", scope: null)
!18 = !{!19, !31}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !14, file: !2, baseType: !20, size: 128, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !21, templateParams: !25, identifier: "6d2fb28423476875809fd2991d9a1f7c")
!21 = !{!22, !26}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !20, file: !2, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !25, identifier: "6fd93551db88d8c1b64f6b4a7e74a944")
!25 = !{}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !20, file: !2, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 3, lowerBound: 0)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !14, file: !2, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::PadAdapterState", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "PadAdapterState", scope: !15, file: !2, size: 8, align: 8, elements: !34, templateParams: !25, identifier: "68f71e1d36e524a037147f46a27f5bed")
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "on_newline", scope: !33, file: !2, baseType: !36, size: 8, align: 8)
!36 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "<&mut core::fmt::builders::PadAdapter as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut core::fmt::builders::PadAdapter as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !40, vtableHolder: !47, templateParams: !25, identifier: "12c87dd0e4011be9489bef7f0e0711ae")
!40 = !{!41, !42, !43, !44, !45, !46}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !39, file: !2, baseType: !6, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !39, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !39, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !39, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !39, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !39, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::PadAdapter", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "<&mut std::io::Write::write_fmt::Adapter<std::io::stdio::StdoutLock> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut std::io::Write::write_fmt::Adapter<std::io::stdio::StdoutLock> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !51, vtableHolder: !58, templateParams: !25, identifier: "daeb5bbda6270e3f343ebed63e65f47f")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !50, file: !2, baseType: !6, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !50, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !50, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !50, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !50, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !50, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::io::Write::write_fmt::Adapter<std::io::stdio::StdoutLock>", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adapter<std::io::stdio::StdoutLock>", scope: !60, file: !2, size: 128, align: 64, elements: !64, templateParams: !212, identifier: "4428d1a9069d4ccb2923a0c580b1fbdc")
!60 = !DINamespace(name: "write_fmt", scope: !61)
!61 = !DINamespace(name: "Write", scope: !62)
!62 = !DINamespace(name: "io", scope: !63)
!63 = !DINamespace(name: "std", scope: null)
!64 = !{!65, !180}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !59, file: !2, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::io::stdio::StdoutLock", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "StdoutLock", scope: !68, file: !2, size: 64, align: 64, elements: !69, templateParams: !25, identifier: "80431ea44095f6a77e5b83def694f08b")
!68 = !DINamespace(name: "stdio", scope: !62)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !67, file: !2, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReentrantMutexGuard<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>", scope: !72, file: !2, size: 64, align: 64, elements: !74, templateParams: !176, identifier: "60063d3a2b486a2a1b8bc9581ae3e49")
!72 = !DINamespace(name: "remutex", scope: !73)
!73 = !DINamespace(name: "sys_common", scope: !63)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !71, file: !2, baseType: !76, size: 64, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pin<&std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>>", scope: !77, file: !2, size: 64, align: 64, elements: !78, templateParams: !178, identifier: "65f192d052e7b42ccaf63834cb67b134")
!77 = !DINamespace(name: "pin", scope: !17)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !76, file: !2, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>", baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>", scope: !72, file: !2, size: 640, align: 64, elements: !82, templateParams: !176, identifier: "9a382494b1d61e7ea2a7ca719de801f4")
!82 = !{!83, !108, !174}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !81, file: !2, baseType: !84, size: 320, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReentrantMutex", scope: !85, file: !2, size: 320, align: 64, elements: !89, templateParams: !25, identifier: "9d95f37d6e2504369df215d9a9b591f4")
!85 = !DINamespace(name: "pthread_remutex", scope: !86)
!86 = !DINamespace(name: "locks", scope: !87)
!87 = !DINamespace(name: "unix", scope: !88)
!88 = !DINamespace(name: "sys", scope: !63)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !84, file: !2, baseType: !91, size: 320, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<libc::unix::linux_like::linux::pthread_mutex_t>", scope: !92, file: !2, size: 320, align: 64, elements: !93, templateParams: !106, identifier: "e868068328b3aee2c6c593f4d21b647f")
!92 = !DINamespace(name: "cell", scope: !17)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !91, file: !2, baseType: !95, size: 320, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_mutex_t", scope: !96, file: !2, size: 320, align: 64, elements: !100, templateParams: !25, identifier: "1bd9ee53172c43b4238b6785bff6b1b6")
!96 = !DINamespace(name: "linux", scope: !97)
!97 = !DINamespace(name: "linux_like", scope: !98)
!98 = !DINamespace(name: "unix", scope: !99)
!99 = !DINamespace(name: "libc", scope: null)
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !95, file: !2, baseType: !102, size: 320, align: 8)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 320, align: 8, elements: !104)
!103 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!104 = !{!105}
!105 = !DISubrange(count: 40, lowerBound: 0)
!106 = !{!107}
!107 = !DITemplateTypeParameter(name: "T", type: !95)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !81, file: !2, baseType: !109, size: 320, align: 64, offset: 320)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>", scope: !92, file: !2, size: 320, align: 64, elements: !110, templateParams: !172, identifier: "6a64912a490984649710ff4edf27e95d")
!110 = !{!111, !121}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !109, file: !2, baseType: !112, size: 64, align: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<isize>", scope: !92, file: !2, size: 64, align: 64, elements: !113, templateParams: !119, identifier: "d0b2826b8fb96cf7a313747cd2905ecf")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !112, file: !2, baseType: !115, size: 64, align: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<isize>", scope: !92, file: !2, size: 64, align: 64, elements: !116, templateParams: !119, identifier: "671821318b45bbb4c90cf4bfa404a018")
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !115, file: !2, baseType: !118, size: 64, align: 64)
!118 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!119 = !{!120}
!120 = !DITemplateTypeParameter(name: "T", type: !118)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !109, file: !2, baseType: !122, size: 256, align: 64, offset: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>", scope: !92, file: !2, size: 256, align: 64, elements: !123, templateParams: !172, identifier: "d01d7b9193ad7f2fefeb5aab8d7f6d9e")
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !122, file: !2, baseType: !125, size: 256, align: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "LineWriter<std::io::stdio::StdoutRaw>", scope: !126, file: !2, size: 256, align: 64, elements: !128, templateParams: !170, identifier: "61ee69ec1d579cf4f90e1d93f4d8879")
!126 = !DINamespace(name: "linewriter", scope: !127)
!127 = !DINamespace(name: "buffered", scope: !62)
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !125, file: !2, baseType: !130, size: 256, align: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "BufWriter<std::io::stdio::StdoutRaw>", scope: !131, file: !2, size: 256, align: 64, elements: !132, templateParams: !170, identifier: "f0dcca51f7d56f4d9f4cf34620e25bee")
!131 = !DINamespace(name: "bufwriter", scope: !127)
!132 = !{!133, !141, !169}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !130, file: !2, baseType: !134, align: 8)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "StdoutRaw", scope: !68, file: !2, align: 8, elements: !135, templateParams: !25, identifier: "6f5a7a101533c6711fe5d8e25fb43b7a")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !137, align: 8)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stdout", scope: !138, file: !2, align: 8, elements: !139, templateParams: !25, identifier: "a2586fd4d96760064e2ebe72560a9ce")
!138 = !DINamespace(name: "stdio", scope: !87)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !137, file: !2, baseType: !7, align: 8)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !130, file: !2, baseType: !142, size: 192, align: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !143, file: !2, size: 192, align: 64, elements: !145, templateParams: !166, identifier: "9bdb5e2dab43f37dd9c512b6b79fbbfa")
!143 = !DINamespace(name: "vec", scope: !144)
!144 = !DINamespace(name: "alloc", scope: null)
!145 = !{!146, !168}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !142, file: !2, baseType: !147, size: 128, align: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !148, file: !2, size: 128, align: 64, elements: !149, templateParams: !166, identifier: "92fc1f49cca49bf7cc4e905fb505e7b")
!148 = !DINamespace(name: "raw_vec", scope: !144)
!149 = !{!150, !162, !163}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !147, file: !2, baseType: !151, size: 64, align: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !152, file: !2, size: 64, align: 64, elements: !154, templateParams: !160, identifier: "66db17c06cca20f3165488c8ba96169d")
!152 = !DINamespace(name: "unique", scope: !153)
!153 = !DINamespace(name: "ptr", scope: !17)
!154 = !{!155, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !151, file: !2, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !151, file: !2, baseType: !158, align: 8)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !159, file: !2, align: 8, elements: !25, templateParams: !160, identifier: "a011c17b0d3b79df1ffc0636e0612f04")
!159 = !DINamespace(name: "marker", scope: !17)
!160 = !{!161}
!161 = !DITemplateTypeParameter(name: "T", type: !103)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !147, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !147, file: !2, baseType: !164, align: 8)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !165, file: !2, align: 8, elements: !25, identifier: "4c2b9def2b4a93a8527c19eb2fa7b400")
!165 = !DINamespace(name: "alloc", scope: !144)
!166 = !{!161, !167}
!167 = !DITemplateTypeParameter(name: "A", type: !164)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !142, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "panicked", scope: !130, file: !2, baseType: !36, size: 8, align: 8, offset: 192)
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "W", type: !134)
!172 = !{!173}
!173 = !DITemplateTypeParameter(name: "T", type: !125)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_pinned", scope: !81, file: !2, baseType: !175, align: 8)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomPinned", scope: !159, file: !2, align: 8, elements: !25, identifier: "61054d04cc4d1c6dfee0429b0098a8b1")
!176 = !{!177}
!177 = !DITemplateTypeParameter(name: "T", type: !109)
!178 = !{!179}
!179 = !DITemplateTypeParameter(name: "P", type: !80)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !59, file: !2, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), std::io::error::Error>", scope: !182, file: !2, size: 64, align: 64, elements: !183, templateParams: !25, identifier: "5b518cb76e5ad7e8627a94f9df27c0b8")
!182 = !DINamespace(name: "result", scope: !17)
!183 = !{!184}
!184 = !DICompositeType(tag: DW_TAG_variant_part, scope: !181, file: !2, size: 64, align: 64, elements: !185, templateParams: !25, identifier: "5675b422847863004a0461b0a8b033e8", discriminator: !210)
!185 = !{!186, !206}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !184, file: !2, baseType: !187, size: 64, align: 64, extraData: i64 0)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !181, file: !2, size: 64, align: 64, elements: !188, templateParams: !190, identifier: "aae4d5ab59293be99c0209e9c24222c4")
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !187, file: !2, baseType: !7, align: 8)
!190 = !{!191, !192}
!191 = !DITemplateTypeParameter(name: "T", type: !7)
!192 = !DITemplateTypeParameter(name: "E", type: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !194, file: !2, size: 64, align: 64, elements: !195, templateParams: !25, identifier: "70040c27739af34f7ca242f9258de728")
!194 = !DINamespace(name: "error", scope: !62)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !193, file: !2, baseType: !197, size: 64, align: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !198, file: !2, size: 64, align: 64, elements: !199, templateParams: !25, identifier: "8501f1fd5d2be4e74e44a2f80653673c")
!198 = !DINamespace(name: "repr_bitpacked", scope: !194)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !197, file: !2, baseType: !201, size: 64, align: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !202, file: !2, size: 64, align: 64, elements: !203, templateParams: !205, identifier: "a4d7a77495aa373578134aa527c18ff")
!202 = !DINamespace(name: "non_null", scope: !153)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !201, file: !2, baseType: !6, size: 64, align: 64)
!205 = !{!191}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !184, file: !2, baseType: !207, size: 64, align: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !181, file: !2, size: 64, align: 64, elements: !208, templateParams: !190, identifier: "8606b6c22eb0f241c204fbe55d80bdca")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !207, file: !2, baseType: !193, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !2, baseType: !211, size: 64, align: 64, flags: DIFlagArtificial)
!211 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!212 = !{!213}
!213 = !DITemplateTypeParameter(name: "T", type: !67)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "<&mut std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !217, vtableHolder: !224, templateParams: !25, identifier: "bda60cee74dee792dd1cae0b35ddd79a")
!217 = !{!218, !219, !220, !221, !222, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !216, file: !2, baseType: !6, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !216, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !216, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !216, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !216, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !216, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr>", baseType: !225, size: 64, align: 64, dwarfAddressSpace: 0)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adapter<std::sys::unix::stdio::Stderr>", scope: !60, file: !2, size: 128, align: 64, elements: !226, templateParams: !233, identifier: "c73fa93df54e1c97d05b5b48e0efc35d")
!226 = !{!227, !232}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !225, file: !2, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sys::unix::stdio::Stderr", baseType: !229, size: 64, align: 64, dwarfAddressSpace: 0)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stderr", scope: !138, file: !2, align: 8, elements: !230, templateParams: !25, identifier: "322fdc82c6cef82977b4f8c568b7ac03")
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !229, file: !2, baseType: !7, align: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !225, file: !2, baseType: !181, size: 64, align: 64, offset: 64)
!233 = !{!234}
!234 = !DITemplateTypeParameter(name: "T", type: !229)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !238, vtableHolder: !243, templateParams: !25, identifier: "f39d4c002c0f87e18aee0d7d77d33b2a")
!238 = !{!239, !240, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !237, file: !2, baseType: !6, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !237, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !237, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !237, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "<&&std::ffi::c_str::NulError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&std::ffi::c_str::NulError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !247, vtableHolder: !252, templateParams: !25, identifier: "46999d213735967c8eb4737dbb1277b")
!247 = !{!248, !249, !250, !251}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !246, file: !2, baseType: !6, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !246, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !246, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !246, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&std::ffi::c_str::NulError", baseType: !253, size: 64, align: 64, dwarfAddressSpace: 0)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::ffi::c_str::NulError", baseType: !254, size: 64, align: 64, dwarfAddressSpace: 0)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "NulError", scope: !255, file: !2, size: 256, align: 64, elements: !257, templateParams: !25, identifier: "b19d7d3f6536aa036ff1725ecc926b1")
!255 = !DINamespace(name: "c_str", scope: !256)
!256 = !DINamespace(name: "ffi", scope: !63)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !254, file: !2, baseType: !9, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !254, file: !2, baseType: !142, size: 192, align: 64, offset: 64)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "<&() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !263, vtableHolder: !268, templateParams: !25, identifier: "14e55580db2a7abc96a20fcf4300aaff")
!263 = !{!264, !265, !266, !267}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !262, file: !2, baseType: !6, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !262, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !262, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !262, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "CLEANUP", linkageName: "_ZN3std2rt7cleanup7CLEANUP17heddbc53b78770dedE", scope: !271, file: !273, line: 94, type: !274, isLocal: true, isDefinition: true, align: 8)
!271 = !DINamespace(name: "cleanup", scope: !272)
!272 = !DINamespace(name: "rt", scope: !63)
!273 = !DIFile(filename: "library/std/src/rt.rs", directory: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src", checksumkind: CSK_MD5, checksum: "53ba40c54b421907f2e3ab22fb96d5b4")
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", scope: !275, file: !2, size: 64, align: 64, elements: !277, templateParams: !25, identifier: "211e17e40551b3e22a1f3ecf1c24849d")
!275 = !DINamespace(name: "once", scope: !276)
!276 = !DINamespace(name: "sync", scope: !63)
!277 = !{!278, !289}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "state_and_queue", scope: !274, file: !2, baseType: !279, size: 64, align: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !280, file: !2, size: 64, align: 64, elements: !282, templateParams: !25, identifier: "29c4f3d0500fc3e4625342a0adf4e49")
!280 = !DINamespace(name: "atomic", scope: !281)
!281 = !DINamespace(name: "sync", scope: !17)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !279, file: !2, baseType: !284, size: 64, align: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !92, file: !2, size: 64, align: 64, elements: !285, templateParams: !287, identifier: "8e7bb4f40b1a7d0f7337938e964b1227")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !2, baseType: !9, size: 64, align: 64)
!287 = !{!288}
!288 = !DITemplateTypeParameter(name: "T", type: !9)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !274, file: !2, baseType: !290, align: 8)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*const std::sync::once::Waiter>", scope: !159, file: !2, align: 8, elements: !25, templateParams: !291, identifier: "40d4c615506bc5d46cd161971be6d8d8")
!291 = !{!292}
!292 = !DITemplateTypeParameter(name: "T", type: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const std::sync::once::Waiter", baseType: !294, size: 64, align: 64, dwarfAddressSpace: 0)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waiter", scope: !275, file: !2, size: 192, align: 64, elements: !295, templateParams: !25, identifier: "ecab6a75835062e4b637813ee54f62a")
!295 = !{!296, !390, !397}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !294, file: !2, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<core::option::Option<std::thread::Thread>>", scope: !92, file: !2, size: 64, align: 64, elements: !298, templateParams: !388, identifier: "9f69e53708fcba2d14432d87f33135af")
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !297, file: !2, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<std::thread::Thread>>", scope: !92, file: !2, size: 64, align: 64, elements: !301, templateParams: !388, identifier: "c9776c569fcb01bd856575a10afcf95")
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !300, file: !2, baseType: !303, size: 64, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::thread::Thread>", scope: !304, file: !2, size: 64, align: 64, elements: !305, templateParams: !25, identifier: "6bf025b57d0fdeea353f866720b47ce")
!304 = !DINamespace(name: "option", scope: !17)
!305 = !{!306}
!306 = !DICompositeType(tag: DW_TAG_variant_part, scope: !303, file: !2, size: 64, align: 64, elements: !307, templateParams: !25, identifier: "d8aa0bc36a678d0bcefb604be8f70dca", discriminator: !387)
!307 = !{!308, !383}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !306, file: !2, baseType: !309, size: 64, align: 64, extraData: i64 0)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !303, file: !2, size: 64, align: 64, elements: !25, templateParams: !310, identifier: "f34f15a349cb04e124f059de1ccec07c")
!310 = !{!311}
!311 = !DITemplateTypeParameter(name: "T", type: !312)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !313, file: !2, size: 64, align: 64, elements: !314, templateParams: !25, identifier: "3f7ac7273d766cff9c875b231feb8efa")
!313 = !DINamespace(name: "thread", scope: !63)
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !312, file: !2, baseType: !316, size: 64, align: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner>", scope: !317, file: !2, size: 64, align: 64, elements: !318, templateParams: !377, identifier: "af630c33a961bc3b49de5a391ac9c686")
!317 = !DINamespace(name: "sync", scope: !144)
!318 = !{!319, !381}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !316, file: !2, baseType: !320, size: 64, align: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !202, file: !2, size: 64, align: 64, elements: !321, templateParams: !379, identifier: "5f668410b0492960fd512e1f6cdf649f")
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !320, file: !2, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Inner>", baseType: !324, size: 64, align: 64, dwarfAddressSpace: 0)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !317, file: !2, size: 384, align: 64, elements: !325, templateParams: !377, identifier: "7c8f134dc8f1d01e3e50229bf9f1ebf3")
!325 = !{!326, !327, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !324, file: !2, baseType: !279, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !324, file: !2, baseType: !279, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !2, baseType: !329, size: 256, align: 64, offset: 128)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !313, file: !2, size: 256, align: 64, elements: !330, templateParams: !25, identifier: "e82d1d475ae955f49c4c54e049a0d49c")
!330 = !{!331, !353, !362}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !329, file: !2, baseType: !332, size: 128, align: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::ffi::c_str::CString>", scope: !304, file: !2, size: 128, align: 64, elements: !333, templateParams: !25, identifier: "2740fa1c40d44048c96c13a3c45b7f0f")
!333 = !{!334}
!334 = !DICompositeType(tag: DW_TAG_variant_part, scope: !332, file: !2, size: 128, align: 64, elements: !335, templateParams: !25, identifier: "135e62ff76d6beed8ca332c28deb748", discriminator: !352)
!335 = !{!336, !348}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !334, file: !2, baseType: !337, size: 128, align: 64, extraData: i64 0)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !332, file: !2, size: 128, align: 64, elements: !25, templateParams: !338, identifier: "d95e6dcec695dc55d3ae7f8305ed8eb")
!338 = !{!339}
!339 = !DITemplateTypeParameter(name: "T", type: !340)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !255, file: !2, size: 128, align: 64, elements: !341, templateParams: !25, identifier: "753008566f07367af9b5fab5caa1c98c")
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !340, file: !2, baseType: !343, size: 128, align: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !344, templateParams: !25, identifier: "51bb628e73feaf6c9f42583eb7842eec")
!344 = !{!345, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !343, file: !2, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !343, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !334, file: !2, baseType: !349, size: 128, align: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !332, file: !2, size: 128, align: 64, elements: !350, templateParams: !338, identifier: "e54dc41613bcb6ea2f108fe89d919828")
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !349, file: !2, baseType: !340, size: 128, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, scope: !332, file: !2, baseType: !211, size: 64, align: 64, flags: DIFlagArtificial)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !329, file: !2, baseType: !354, size: 64, align: 64, offset: 128)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !313, file: !2, size: 64, align: 64, elements: !355, templateParams: !25, identifier: "a1cd3931369e7bb7e221fc8bc67a2914")
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !354, file: !2, baseType: !357, size: 64, align: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64", scope: !358, file: !2, size: 64, align: 64, elements: !360, templateParams: !25, identifier: "8b85ac3fd2485895ba62741d4117235")
!358 = !DINamespace(name: "nonzero", scope: !359)
!359 = !DINamespace(name: "num", scope: !17)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !357, file: !2, baseType: !211, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !329, file: !2, baseType: !363, size: 32, align: 32, offset: 192)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !364, file: !2, size: 32, align: 32, elements: !366, templateParams: !25, identifier: "3327ed33bca73e04eea2e4420b61970b")
!364 = !DINamespace(name: "futex", scope: !365)
!365 = !DINamespace(name: "thread_parker", scope: !73)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !363, file: !2, baseType: !368, size: 32, align: 32)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicI32", scope: !280, file: !2, size: 32, align: 32, elements: !369, templateParams: !25, identifier: "9fe6a906879e85cad58b702d527120d5")
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !368, file: !2, baseType: !371, size: 32, align: 32)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<i32>", scope: !92, file: !2, size: 32, align: 32, elements: !372, templateParams: !375, identifier: "8731c18031e019724c8f6a6138e50b78")
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !371, file: !2, baseType: !374, size: 32, align: 32)
!374 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!375 = !{!376}
!376 = !DITemplateTypeParameter(name: "T", type: !374)
!377 = !{!378}
!378 = !DITemplateTypeParameter(name: "T", type: !329)
!379 = !{!380}
!380 = !DITemplateTypeParameter(name: "T", type: !324)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !316, file: !2, baseType: !382, align: 8)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !159, file: !2, align: 8, elements: !25, templateParams: !379, identifier: "44f42f95a9e8467b18b2656700fa49ff")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !306, file: !2, baseType: !384, size: 64, align: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !303, file: !2, size: 64, align: 64, elements: !385, templateParams: !310, identifier: "7f3368be57d8359dc695bddbbb936a8")
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !384, file: !2, baseType: !312, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, scope: !303, file: !2, baseType: !211, size: 64, align: 64, flags: DIFlagArtificial)
!388 = !{!389}
!389 = !DITemplateTypeParameter(name: "T", type: !303)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !294, file: !2, baseType: !391, size: 8, align: 8, offset: 128)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !280, file: !2, size: 8, align: 8, elements: !392, templateParams: !25, identifier: "66f3bdd2b13a964f6dd774d17ac73552")
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !391, file: !2, baseType: !394, size: 8, align: 8)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !92, file: !2, size: 8, align: 8, elements: !395, templateParams: !160, identifier: "9adc2cc27bde296981f98ccb05e6af4b")
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !394, file: !2, baseType: !103, size: 8, align: 8)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !2, baseType: !293, size: 64, align: 64, offset: 64)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "GUARD", linkageName: "_ZN3std6thread8ThreadId3new5GUARD17ha36fdc0f2ae0d897E", scope: !400, file: !402, line: 1030, type: !403, isLocal: true, isDefinition: true, align: 8)
!400 = !DINamespace(name: "new", scope: !401)
!401 = !DINamespace(name: "{impl#1}", scope: !313)
!402 = !DIFile(filename: "library/std/src/thread/mod.rs", directory: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src", checksumkind: CSK_MD5, checksum: "1c4691084a6583a6ad4fc29dc703d786")
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "StaticMutex", scope: !404, file: !2, size: 320, align: 64, elements: !405, templateParams: !25, identifier: "ca0185548800e4ecd117571a83191bfc")
!404 = !DINamespace(name: "mutex", scope: !73)
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !403, file: !2, baseType: !407, size: 320, align: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !408, file: !2, size: 320, align: 64, elements: !409, templateParams: !25, identifier: "c350f26ee19ea2dba091f6cd58219c80")
!408 = !DINamespace(name: "pthread_mutex", scope: !86)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !407, file: !2, baseType: !91, size: 320, align: 64)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "COUNTER", linkageName: "_ZN3std6thread8ThreadId3new7COUNTER17h21f596cfdf2cc5b8E", scope: !400, file: !402, line: 1031, type: !211, isLocal: true, isDefinition: true, align: 8)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "STDOUT", linkageName: "_ZN3std2io5stdio6STDOUT17h969252c428b23eacE", scope: !68, file: !415, line: 556, type: !416, isLocal: true, isDefinition: true, align: 8)
!415 = !DIFile(filename: "library/std/src/io/stdio.rs", directory: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src", checksumkind: CSK_MD5, checksum: "d519e4841a2dbd5626e66ea31b23b438")
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "SyncOnceCell<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>>", scope: !417, file: !2, size: 704, align: 64, elements: !418, templateParams: !434, identifier: "c9f51bae2d628a54bf397af9aa87cff8")
!417 = !DINamespace(name: "lazy", scope: !63)
!418 = !{!419, !420, !438}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "once", scope: !416, file: !2, baseType: !274, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !416, file: !2, baseType: !421, size: 640, align: 64, offset: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::mem::maybe_uninit::MaybeUninit<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>>>", scope: !92, file: !2, size: 640, align: 64, elements: !422, templateParams: !436, identifier: "c860ba740e5b0a2a7a668f2528004abb")
!422 = !{!423}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !421, file: !2, baseType: !424, size: 640, align: 64)
!424 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>>", scope: !425, file: !2, size: 640, align: 64, elements: !427, templateParams: !434, identifier: "90708ab0045e3ed5425790b49c311452")
!425 = !DINamespace(name: "maybe_uninit", scope: !426)
!426 = !DINamespace(name: "mem", scope: !17)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !424, file: !2, baseType: !7, align: 8)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !424, file: !2, baseType: !430, size: 640, align: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>>", scope: !431, file: !2, size: 640, align: 64, elements: !432, templateParams: !434, identifier: "f113bf9c1c5aaefbcecee3626d874d1a")
!431 = !DINamespace(name: "manually_drop", scope: !426)
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !430, file: !2, baseType: !81, size: 640, align: 64)
!434 = !{!435}
!435 = !DITemplateTypeParameter(name: "T", type: !81)
!436 = !{!437}
!437 = !DITemplateTypeParameter(name: "T", type: !424)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !416, file: !2, baseType: !439, align: 8)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>>", scope: !159, file: !2, align: 8, elements: !25, templateParams: !434, identifier: "6ca5cc2958fd235d4afe5d540d76df4e")
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "<std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !442, isLocal: true, isDefinition: true)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::Write::write_fmt::Adapter<std::sys::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !443, vtableHolder: !225, templateParams: !25, identifier: "c05f6a575132fc43dd6e1f53ba4f4fa8")
!443 = !{!444, !445, !446, !447, !448, !449}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !442, file: !2, baseType: !6, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !442, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !442, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !442, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !442, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !442, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "<std::io::Write::write_fmt::Adapter<std::io::stdio::StdoutLock> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::Write::write_fmt::Adapter<std::io::stdio::StdoutLock> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !453, vtableHolder: !59, templateParams: !25, identifier: "a9ef045d93a1debaebdee918405f0f7b")
!453 = !{!454, !455, !456, !457, !458, !459}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !452, file: !2, baseType: !6, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !452, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !452, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !452, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !452, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !452, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "<std::sync::once::{impl#4}::call_once::{closure_env#0}<std::rt::cleanup::{closure_env#0}> as core::ops::function::FnMut<(&std::sync::once::OnceState)>>::{vtable}", scope: null, file: !2, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::once::{impl#4}::call_once::{closure_env#0}<std::rt::cleanup::{closure_env#0}> as core::ops::function::FnMut<(&std::sync::once::OnceState)>>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !463, vtableHolder: !469, templateParams: !25, identifier: "bc4bd176287497779693e7525a3d6179")
!463 = !{!464, !465, !466, !467, !468}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !462, file: !2, baseType: !6, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !462, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !462, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !462, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !462, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<std::rt::cleanup::{closure_env#0}>", scope: !470, file: !2, size: 64, align: 64, elements: !472, templateParams: !25, identifier: "878aa00df7f1e433dc1c2556fa6b8b0")
!470 = !DINamespace(name: "call_once", scope: !471)
!471 = !DINamespace(name: "{impl#4}", scope: !275)
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__f", scope: !469, file: !2, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<std::rt::cleanup::{closure_env#0}>", baseType: !475, size: 64, align: 64, dwarfAddressSpace: 0)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::rt::cleanup::{closure_env#0}>", scope: !304, file: !2, size: 8, align: 8, elements: !476, templateParams: !25, identifier: "25d8e6227ffb9a393b8e659f2f41c26a")
!476 = !{!477}
!477 = !DICompositeType(tag: DW_TAG_variant_part, scope: !475, file: !2, size: 8, align: 8, elements: !478, templateParams: !25, identifier: "c46d9f55353fefc56376d8c45991957c", discriminator: !488)
!478 = !{!479, !484}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !477, file: !2, baseType: !480, size: 8, align: 8, extraData: i64 0)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !475, file: !2, size: 8, align: 8, elements: !25, templateParams: !481, identifier: "3399fe27bab473dce38cbd07b1650b1f")
!481 = !{!482}
!482 = !DITemplateTypeParameter(name: "T", type: !483)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !271, file: !2, align: 8, elements: !25, identifier: "fd87907b18b761028e4b83ec7cda2c25")
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !477, file: !2, baseType: !485, size: 8, align: 8, extraData: i64 1)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !475, file: !2, size: 8, align: 8, elements: !486, templateParams: !481, identifier: "595d1c7a51828018a1899d9c0195ec0")
!486 = !{!487}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !485, file: !2, baseType: !483, align: 8, offset: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, scope: !475, file: !2, baseType: !103, size: 8, align: 8, flags: DIFlagArtificial)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "<std::sync::once::{impl#4}::call_once_force::{closure_env#0}<std::lazy::{impl#10}::get_or_init_pin::{closure_env#0}<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>, std::io::stdio::stdout::{closure_env#0}, std::io::stdio::stdout::{closure_env#1}>> as core::ops::function::FnMut<(&std::sync::once::OnceState)>>::{vtable}", scope: null, file: !2, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::once::{impl#4}::call_once_force::{closure_env#0}<std::lazy::{impl#10}::get_or_init_pin::{closure_env#0}<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>, std::io::stdio::stdout::{closure_env#0}, std::io::stdio::stdout::{closure_env#1}>> as core::ops::function::FnMut<(&std::sync::once::OnceState)>>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !492, vtableHolder: !498, templateParams: !25, identifier: "a89c90545aaf9bbbed3b543bb243faf4")
!492 = !{!493, !494, !495, !496, !497}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !491, file: !2, baseType: !6, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !491, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !491, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !491, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !491, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<std::lazy::{impl#10}::get_or_init_pin::{closure_env#0}<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>, std::io::stdio::stdout::{closure_env#0}, std::io::stdio::stdout::{closure_env#1}>>", scope: !499, file: !2, size: 64, align: 64, elements: !500, templateParams: !25, identifier: "42dff7e607c3ed091d47c9a63c6b2b66")
!499 = !DINamespace(name: "call_once_force", scope: !471)
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__f", scope: !498, file: !2, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<std::lazy::{impl#10}::get_or_init_pin::{closure_env#0}<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>, std::io::stdio::stdout::{closure_env#0}, std::io::stdio::stdout::{closure_env#1}>>", baseType: !503, size: 64, align: 64, dwarfAddressSpace: 0)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::lazy::{impl#10}::get_or_init_pin::{closure_env#0}<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>, std::io::stdio::stdout::{closure_env#0}, std::io::stdio::stdout::{closure_env#1}>>", scope: !304, file: !2, size: 64, align: 64, elements: !504, templateParams: !25, identifier: "d4269dbbabdf02a1ae44b54b4c212c44")
!504 = !{!505}
!505 = !DICompositeType(tag: DW_TAG_variant_part, scope: !503, file: !2, size: 64, align: 64, elements: !506, templateParams: !25, identifier: "fc5ca49739f0728cc19465cc0342e456", discriminator: !526)
!506 = !{!507, !522}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !505, file: !2, baseType: !508, size: 64, align: 64, extraData: i64 0)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !503, file: !2, size: 64, align: 64, elements: !25, templateParams: !509, identifier: "70204b8c012bfbb7124c7e8a7fd7216b")
!509 = !{!510}
!510 = !DITemplateTypeParameter(name: "T", type: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>, std::io::stdio::stdout::{closure_env#0}, std::io::stdio::stdout::{closure_env#1}>", scope: !512, file: !2, size: 64, align: 64, elements: !514, templateParams: !25, identifier: "39f4fba8be008bdb235cddf6d252a52")
!512 = !DINamespace(name: "get_or_init_pin", scope: !513)
!513 = !DINamespace(name: "{impl#10}", scope: !417)
!514 = !{!515, !518, !520}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !511, file: !2, baseType: !516, align: 8)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !517, file: !2, align: 8, elements: !25, identifier: "406c8766445d4dd0c03bee9086719d59")
!517 = !DINamespace(name: "stdout", scope: !68)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__slot", scope: !511, file: !2, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<core::mem::maybe_uninit::MaybeUninit<std::sys_common::remutex::ReentrantMutex<core::cell::RefCell<std::io::buffered::linewriter::LineWriter<std::io::stdio::StdoutRaw>>>>>", baseType: !421, size: 64, align: 64, dwarfAddressSpace: 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !511, file: !2, baseType: !521, align: 8)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#1}", scope: !517, file: !2, align: 8, elements: !25, identifier: "36abbeb7ff97d0b241008209268edc33")
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !505, file: !2, baseType: !523, size: 64, align: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !503, file: !2, size: 64, align: 64, elements: !524, templateParams: !509, identifier: "433a28855ea19c39a6a0eca9d6a29341")
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !523, file: !2, baseType: !511, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, scope: !503, file: !2, baseType: !211, size: 64, align: 64, flags: DIFlagArtificial)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "DTORS", linkageName: "_ZN3std10sys_common17thread_local_dtor22register_dtor_fallback5DTORS17hbfd22b3631c836c0E", scope: !529, file: !531, line: 30, type: !532, isLocal: true, isDefinition: true, align: 8)
!529 = !DINamespace(name: "register_dtor_fallback", scope: !530)
!530 = !DINamespace(name: "thread_local_dtor", scope: !73)
!531 = !DIFile(filename: "library/std/src/sys_common/thread_local_dtor.rs", directory: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src", checksumkind: CSK_MD5, checksum: "8e62834109a1db5b244703bb72640ff2")
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "StaticKey", scope: !533, file: !2, size: 128, align: 64, elements: !534, templateParams: !25, identifier: "7e69415efd683519432f2f9d1f5a9749")
!533 = !DINamespace(name: "thread_local_key", scope: !73)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !532, file: !2, baseType: !279, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !532, file: !2, baseType: !537, size: 64, align: 64, offset: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<unsafe extern \22C\22 fn(*mut u8)>", scope: !304, file: !2, size: 64, align: 64, elements: !538, templateParams: !25, identifier: "277183031b6c2852dcccf21510f970e0")
!538 = !{!539}
!539 = !DICompositeType(tag: DW_TAG_variant_part, scope: !537, file: !2, size: 64, align: 64, elements: !540, templateParams: !25, identifier: "5815afc45cc16731dfdc1eade8f4d07d", discriminator: !553)
!540 = !{!541, !549}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !539, file: !2, baseType: !542, size: 64, align: 64, extraData: i64 0)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !537, file: !2, size: 64, align: 64, elements: !25, templateParams: !543, identifier: "276def9d215ab9f72ca16bff4d46c57a")
!543 = !{!544}
!544 = !DITemplateTypeParameter(name: "T", type: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe extern \22C\22 fn(*mut u8)", baseType: !546, size: 64, align: 64, dwarfAddressSpace: 0)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !539, file: !2, baseType: !550, size: 64, align: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !537, file: !2, size: 64, align: 64, elements: !551, templateParams: !543, identifier: "54383522eba3408e372a277107817602")
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !550, file: !2, baseType: !545, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, scope: !537, file: !2, baseType: !211, size: 64, align: 64, flags: DIFlagArtificial)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "<&alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !557, vtableHolder: !562, templateParams: !25, identifier: "1090f1ce91e54ede313561228a905f2a")
!557 = !{!558, !559, !560, !561}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !556, file: !2, baseType: !6, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !556, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !556, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "ARGV_INIT_ARRAY", linkageName: "_ZN3std3sys4unix4args3imp15ARGV_INIT_ARRAY17h35121d6b24cba6e0E", scope: !565, file: !567, line: 110, type: !568, isLocal: true, isDefinition: true, align: 8)
!565 = !DINamespace(name: "imp", scope: !566)
!566 = !DINamespace(name: "args", scope: !87)
!567 = !DIFile(filename: "library/std/src/sys/unix/args.rs", directory: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src", checksumkind: CSK_MD5, checksum: "6899c2209dbc7df0bd1a197a0f38ccc4")
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22C\22 fn(i32, *const *const u8, *const *const u8)", baseType: !569, size: 64, align: 64, dwarfAddressSpace: 0)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !374, !571, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !156, size: 64, align: 64, dwarfAddressSpace: 0)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "MAIN_ALTSTACK", linkageName: "_ZN3std3sys4unix14stack_overflow3imp13MAIN_ALTSTACK17h5f1cb0a67daa0f52E", scope: !574, file: !576, line: 120, type: !577, isLocal: true, isDefinition: true, align: 8)
!574 = !DINamespace(name: "imp", scope: !575)
!575 = !DINamespace(name: "stack_overflow", scope: !87)
!576 = !DIFile(filename: "library/std/src/sys/unix/stack_overflow.rs", directory: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src", checksumkind: CSK_MD5, checksum: "47db2f7f2477a23844b10220b064366c")
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<core::ffi::c_void>", scope: !280, file: !2, size: 64, align: 64, elements: !578, templateParams: !591, identifier: "5ccacad69c0f2d19b806a7532cf8d65b")
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !577, file: !2, baseType: !580, size: 64, align: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut core::ffi::c_void>", scope: !92, file: !2, size: 64, align: 64, elements: !581, templateParams: !589, identifier: "ecb1d991575b1cb066c8bc30e54367fb")
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !580, file: !2, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !584, size: 64, align: 64, dwarfAddressSpace: 0)
!584 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !585, file: !2, baseType: !103, size: 8, align: 8, flags: DIFlagEnumClass, elements: !586)
!585 = !DINamespace(name: "ffi", scope: !17)
!586 = !{!587, !588}
!587 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!588 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!589 = !{!590}
!590 = !DITemplateTypeParameter(name: "T", type: !583)
!591 = !{!592}
!592 = !DITemplateTypeParameter(name: "T", type: !584)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "NEED_ALTSTACK", linkageName: "_ZN3std3sys4unix14stack_overflow3imp13NEED_ALTSTACK17hfb7a328d02584dfaE", scope: !574, file: !576, line: 121, type: !391, isLocal: true, isDefinition: true, align: 1)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "PAGE_SIZE", linkageName: "_ZN3std3sys4unix6thread5guard9PAGE_SIZE17he6d9d286d73196d9E", scope: !597, file: !599, line: 494, type: !279, isLocal: true, isDefinition: true, align: 8)
!597 = !DINamespace(name: "guard", scope: !598)
!598 = !DINamespace(name: "thread", scope: !87)
!599 = !DIFile(filename: "library/std/src/sys/unix/thread.rs", directory: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src", checksumkind: CSK_MD5, checksum: "3a7a477d064bf795f74f56d1431aed0d")
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "VAL", linkageName: "_ZN3std10sys_common11thread_info11THREAD_INFO7__getit3VAL17h9671c9e1b1a46743E", scope: !602, file: !605, line: 206, type: !606, isLocal: true, isDefinition: true, align: 8)
!602 = !DINamespace(name: "__getit", scope: !603)
!603 = !DINamespace(name: "THREAD_INFO", scope: !604)
!604 = !DINamespace(name: "thread_info", scope: !73)
!605 = !DIFile(filename: "library/std/src/thread/local.rs", directory: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src", checksumkind: CSK_MD5, checksum: "f45ee0d9f756fa3a81b2f9302e0f5c08")
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "RefCell<core::option::Option<std::sys_common::thread_info::ThreadInfo>>", scope: !92, file: !2, size: 320, align: 64, elements: !607, templateParams: !651, identifier: "9921ba1ea7245ea41caed1add008d89d")
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "borrow", scope: !606, file: !2, baseType: !112, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !606, file: !2, baseType: !610, size: 256, align: 64, offset: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<std::sys_common::thread_info::ThreadInfo>>", scope: !92, file: !2, size: 256, align: 64, elements: !611, templateParams: !651, identifier: "451e5b3e1e99f4292171c36b3b71e894")
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !610, file: !2, baseType: !613, size: 256, align: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::sys_common::thread_info::ThreadInfo>", scope: !304, file: !2, size: 256, align: 64, elements: !614, templateParams: !25, identifier: "63a2a18005fc73b1714f8cbc4df93804")
!614 = !{!615}
!615 = !DICompositeType(tag: DW_TAG_variant_part, scope: !613, file: !2, size: 256, align: 64, elements: !616, templateParams: !25, identifier: "b12964fc82bbdfced88a9836e4e8d77d", discriminator: !650)
!616 = !{!617, !646}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !615, file: !2, baseType: !618, size: 256, align: 64, extraData: i64 2)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !613, file: !2, size: 256, align: 64, elements: !25, templateParams: !619, identifier: "c58aa15b2808586b356d748b1e3b3c41")
!619 = !{!620}
!620 = !DITemplateTypeParameter(name: "T", type: !621)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadInfo", scope: !604, file: !2, size: 256, align: 64, elements: !622, templateParams: !25, identifier: "c44742b0cf22f5d6d2487dc3de4645fe")
!622 = !{!623, !645}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "stack_guard", scope: !621, file: !2, baseType: !624, size: 192, align: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::ops::range::Range<usize>>", scope: !304, file: !2, size: 192, align: 64, elements: !625, templateParams: !25, identifier: "d4e03ac17194d84c9527c223d8d9019a")
!625 = !{!626}
!626 = !DICompositeType(tag: DW_TAG_variant_part, scope: !624, file: !2, size: 192, align: 64, elements: !627, templateParams: !25, identifier: "f37295bb5ff878595ab5e07cf1dd5eaf", discriminator: !644)
!627 = !{!628, !640}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !626, file: !2, baseType: !629, size: 192, align: 64, extraData: i64 0)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !624, file: !2, size: 192, align: 64, elements: !25, templateParams: !630, identifier: "c8c98f3dd6248ee1102216c127d989a9")
!630 = !{!631}
!631 = !DITemplateTypeParameter(name: "T", type: !632)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !633, file: !2, size: 128, align: 64, elements: !635, templateParams: !638, identifier: "80ac102dceb19069abf154a38cc71209")
!633 = !DINamespace(name: "range", scope: !634)
!634 = !DINamespace(name: "ops", scope: !17)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !632, file: !2, baseType: !9, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !632, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!638 = !{!639}
!639 = !DITemplateTypeParameter(name: "Idx", type: !9)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !626, file: !2, baseType: !641, size: 192, align: 64, extraData: i64 1)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !624, file: !2, size: 192, align: 64, elements: !642, templateParams: !630, identifier: "bff753009f05f11f4687dd77e0db9cb")
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !641, file: !2, baseType: !632, size: 128, align: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, scope: !624, file: !2, baseType: !211, size: 64, align: 64, flags: DIFlagArtificial)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !621, file: !2, baseType: !312, size: 64, align: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !615, file: !2, baseType: !647, size: 256, align: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !613, file: !2, size: 256, align: 64, elements: !648, templateParams: !619, identifier: "e3a50af4084a1d80de9f4fd47a7c0ba5")
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !647, file: !2, baseType: !621, size: 256, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, scope: !613, file: !2, baseType: !211, size: 64, align: 64, flags: DIFlagArtificial)
!651 = !{!652}
!652 = !DITemplateTypeParameter(name: "T", type: !613)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "STATE", linkageName: "_ZN3std10sys_common11thread_info11THREAD_INFO7__getit5STATE17h8a18862d2e1a24bfE", scope: !602, file: !605, line: 220, type: !103, isLocal: true, isDefinition: true, align: 1)
!655 = !{i32 7, !"PIC Level", i32 2}
!656 = !{i32 7, !"PIE Level", i32 2}
!657 = !{i32 2, !"RtLibUseGOT", i32 1}
!658 = !{i32 2, !"Debug Info Version", i32 3}
!659 = !{i32 1, !"ProfileSummary", !660}
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!661 = !{!"ProfileFormat", !"InstrProf"}
!662 = !{!"TotalCount", i64 11}
!663 = !{!"MaxCount", i64 4}
!664 = !{!"MaxInternalCount", i64 0}
!665 = !{!"MaxFunctionCount", i64 4}
!666 = !{!"NumCounts", i64 12}
!667 = !{!"NumFunctions", i64 12}
!668 = !{!"IsPartialProfile", i64 0}
!669 = !{!"PartialProfileRatio", double 0.000000e+00}
!670 = !{!"DetailedSummary", !671}
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!672 = !{i32 10000, i64 0, i32 0}
!673 = !{i32 100000, i64 4, i32 1}
!674 = !{i32 200000, i64 4, i32 1}
!675 = !{i32 300000, i64 4, i32 1}
!676 = !{i32 400000, i64 4, i32 1}
!677 = !{i32 500000, i64 1, i32 8}
!678 = !{i32 600000, i64 1, i32 8}
!679 = !{i32 700000, i64 1, i32 8}
!680 = !{i32 800000, i64 1, i32 8}
!681 = !{i32 900000, i64 1, i32 8}
!682 = !{i32 950000, i64 1, i32 8}
!683 = !{i32 990000, i64 1, i32 8}
!684 = !{i32 999000, i64 1, i32 8}
!685 = !{i32 999900, i64 1, i32 8}
!686 = !{i32 999990, i64 1, i32 8}
!687 = !{i32 999999, i64 1, i32 8}
!688 = !{i32 5, !"CG Profile", !689}
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698}
!690 = !{void (void ()*)* @_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17haeade97c9c4b22aeE, void ()* @_ZN6rsmain4main17hc77cd4c1e7e61580E, i64 1}
!691 = distinct !{null, void (void ()*)* @_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17haeade97c9c4b22aeE, i64 1}
!692 = !{void ()* @_ZN6rsmain4main17hc77cd4c1e7e61580E, i32 ()* @c_always_inlined, i64 1}
!693 = !{void ()* @_ZN6rsmain4main17hc77cd4c1e7e61580E, i32 ()* @c_never_inlined, i64 1}
!694 = !{void ()* @_ZN6rsmain4main17hc77cd4c1e7e61580E, void (%"core::fmt::Arguments"*)* @_ZN3std2io5stdio6_print17hd6d6e0471852a7eaE, i64 7}
!695 = !{void ()* @_ZN6rsmain4main17hc77cd4c1e7e61580E, i1 ()* @print_it, i64 1}
!696 = !{void ()* @_ZN6rsmain4main17hc77cd4c1e7e61580E, void ()* @hello, i64 4}
!697 = distinct !{i32 (i32, i8**)* @main, null, i64 1}
!698 = distinct !{null, null, i64 4}
!699 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !700, producer: "clang LLVM (rustc version 1.61.0-nightly (1d9c262ee 2022-03-26))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !701, globals: !710)
!700 = !DIFile(filename: "src/main.rs/@/rsmain.19de4ef9-cgu.0", directory: "/insilications/gstuff/stuff/things/build/git-clr/cross-lang-lto-pgo-smoketest2")
!701 = !{!702}
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !703, file: !2, baseType: !103, size: 8, align: 8, flags: DIFlagEnumClass, elements: !705)
!703 = !DINamespace(name: "v1", scope: !704)
!704 = !DINamespace(name: "rt", scope: !16)
!705 = !{!706, !707, !708, !709}
!706 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!707 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!708 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!709 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!710 = !{!711}
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !713, isLocal: true, isDefinition: true)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !714, vtableHolder: !721, templateParams: !25, identifier: "32cbb750aff15888aaab80b87c13db4a")
!714 = !{!715, !716, !717, !718, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !713, file: !2, baseType: !6, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !713, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !713, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !713, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !713, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !722, file: !2, size: 64, align: 64, elements: !723, templateParams: !25, identifier: "9377a3ab466f0a85e0511b88b07c5cf5")
!722 = !DINamespace(name: "lang_start", scope: !272)
!723 = !{!724}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !721, file: !2, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !726, size: 64, align: 64, dwarfAddressSpace: 0)
!726 = !DISubroutineType(types: !727)
!727 = !{null}
!728 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17haeade97c9c4b22aeE", scope: !730, file: !729, line: 118, type: !731, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !699, templateParams: !737, retainedNodes: !733)
!729 = !DIFile(filename: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7c76d4902bfcea1d96ffad8fbde919d")
!730 = !DINamespace(name: "backtrace", scope: !73)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !725}
!733 = !{!734, !735}
!734 = !DILocalVariable(name: "f", arg: 1, scope: !728, file: !729, line: 118, type: !725)
!735 = !DILocalVariable(name: "result", scope: !736, file: !729, line: 122, type: !7, align: 1)
!736 = distinct !DILexicalBlock(scope: !728, file: !729, line: 122, column: 5)
!737 = !{!738, !191}
!738 = !DITemplateTypeParameter(name: "F", type: !725)
!739 = !{!"function_entry_count", i64 1}
!740 = !{!"rsmain.19de4ef9-cgu.0:_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17haeade97c9c4b22aeE"}
!741 = !DILocation(line: 122, column: 9, scope: !736)
!742 = !DILocation(line: 0, scope: !728)
!743 = !DILocalVariable(arg: 1, scope: !744, file: !745, line: 227, type: !725)
!744 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17he8498bcb77caedc2E", scope: !746, file: !745, line: 227, type: !731, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !699, templateParams: !750, retainedNodes: !748)
!745 = !DIFile(filename: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "1a40c014f8a7b8b7cd612b461a47e902")
!746 = !DINamespace(name: "FnOnce", scope: !747)
!747 = !DINamespace(name: "function", scope: !634)
!748 = !{!743, !749}
!749 = !DILocalVariable(arg: 2, scope: !744, file: !745, line: 227, type: !7)
!750 = !{!751, !752}
!751 = !DITemplateTypeParameter(name: "Self", type: !725)
!752 = !DITemplateTypeParameter(name: "Args", type: !7)
!753 = !DILocation(line: 0, scope: !744, inlinedAt: !754)
!754 = distinct !DILocation(line: 122, column: 18, scope: !728)
!755 = !DILocation(line: 227, column: 5, scope: !744, inlinedAt: !754)
!756 = !{!"branch_weights", i32 1, i32 0}
!757 = !DILocalVariable(name: "dummy", arg: 1, scope: !758, file: !759, line: 173, type: !7)
!758 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h820b67bc8b630295E", scope: !760, file: !759, line: 173, type: !761, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !699, templateParams: !205, retainedNodes: !763)
!759 = !DIFile(filename: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "d47ba4250ff9af130f0d9cedc851ffc1")
!760 = !DINamespace(name: "hint", scope: !17)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !7}
!763 = !{!757}
!764 = !DILocation(line: 173, column: 27, scope: !758, inlinedAt: !765)
!765 = distinct !DILocation(line: 125, column: 5, scope: !736)
!766 = !DILocation(line: 174, column: 5, scope: !758, inlinedAt: !765)
!767 = !{i32 3275021}
!768 = !DILocation(line: 128, column: 2, scope: !728)
!769 = distinct !DISubprogram(name: "caralho", scope: !771, file: !770, line: 12, type: !726, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !699, templateParams: !25, retainedNodes: !25)
!770 = !DIFile(filename: "src/main.rs", directory: "/insilications/gstuff/stuff/things/build/git-clr/cross-lang-lto-pgo-smoketest2", checksumkind: CSK_MD5, checksum: "5dee9b65afcf3ff89a846407b0f3e81d")
!771 = !DINamespace(name: "rsmain", scope: null)
!772 = !{!"function_entry_count", i64 0}
!773 = !DILocation(line: 13, column: 5, scope: !769)
!774 = !DILocalVariable(name: "pieces", arg: 1, scope: !775, file: !776, line: 383, type: !780)
!775 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h6e75abd41b7e726bE", scope: !777, file: !776, line: 383, type: !892, scopeLine: 383, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !699, templateParams: !25, retainedNodes: !894)
!776 = !DIFile(filename: "/builddir/build/BUILD/rust-nightly-x86_64-unknown-linux-gnu/rustc-nightly-src/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "cfa59b747bb507686552f94c3fbe163c")
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !16, file: !2, size: 384, align: 64, elements: !778, templateParams: !25, identifier: "4eb6e8257d9a5288429075b63f757c91")
!778 = !{!779, !789, !836}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !777, file: !2, baseType: !780, size: 128, align: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !781, templateParams: !25, identifier: "120d786d314e2730a5f45c5e7e56f7d")
!781 = !{!782, !788}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !780, file: !2, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64, align: 64, dwarfAddressSpace: 0)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !785, templateParams: !25, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !784, file: !2, baseType: !346, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !784, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !780, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !777, file: !2, baseType: !790, size: 128, align: 64, offset: 128)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !304, file: !2, size: 128, align: 64, elements: !791, templateParams: !25, identifier: "43eeb7f8b4424d7c9d8ae5693a0271df")
!791 = !{!792}
!792 = !DICompositeType(tag: DW_TAG_variant_part, scope: !790, file: !2, size: 128, align: 64, elements: !793, templateParams: !25, identifier: "9796e2da9288382f997ca77cbeb6595c", discriminator: !835)
!793 = !{!794, !831}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !792, file: !2, baseType: !795, size: 128, align: 64, extraData: i64 0)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !790, file: !2, size: 128, align: 64, elements: !25, templateParams: !796, identifier: "7c909e88bd947b2c57a5d65e0bcb3b10")
!796 = !{!797}
!797 = !DITemplateTypeParameter(name: "T", type: !798)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !799, templateParams: !25, identifier: "ab11a5170419509d9754e721a100e787")
!799 = !{!800, !830}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !798, file: !2, baseType: !801, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64, dwarfAddressSpace: 0)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !703, file: !2, size: 448, align: 64, elements: !803, templateParams: !25, identifier: "bf86c0b4c4a561927e1f4258cc8c55c6")
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !802, file: !2, baseType: !9, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !802, file: !2, baseType: !806, size: 384, align: 64, offset: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !703, file: !2, size: 384, align: 64, elements: !807, templateParams: !25, identifier: "d136753293618b32d926813c78b2a4cc")
!807 = !{!808, !810, !811, !813, !829}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !806, file: !2, baseType: !809, size: 32, align: 32, offset: 256)
!809 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !806, file: !2, baseType: !702, size: 8, align: 8, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !806, file: !2, baseType: !812, size: 32, align: 32, offset: 288)
!812 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !806, file: !2, baseType: !814, size: 128, align: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !703, file: !2, size: 128, align: 64, elements: !815, templateParams: !25, identifier: "63747121f9b71e7268d266c6aa1321c5")
!815 = !{!816}
!816 = !DICompositeType(tag: DW_TAG_variant_part, scope: !814, file: !2, size: 128, align: 64, elements: !817, templateParams: !25, identifier: "f0b444698bb7f8f63a32b1f1a8e45fb3", discriminator: !828)
!817 = !{!818, !822, !826}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !816, file: !2, baseType: !819, size: 128, align: 64, extraData: i64 0)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !814, file: !2, size: 128, align: 64, elements: !820, templateParams: !25, identifier: "9f7c39ffff50acaaa4a7ded57767fe85")
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !819, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !816, file: !2, baseType: !823, size: 128, align: 64, extraData: i64 1)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !814, file: !2, size: 128, align: 64, elements: !824, templateParams: !25, identifier: "8a260c30d573ed7f9c3f88064af0cd99")
!824 = !{!825}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !823, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !816, file: !2, baseType: !827, size: 128, align: 64, extraData: i64 2)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !814, file: !2, size: 128, align: 64, elements: !25, identifier: "5cff897c18132047da72c1ec4d4e5fe3")
!828 = !DIDerivedType(tag: DW_TAG_member, scope: !814, file: !2, baseType: !211, size: 64, align: 64, flags: DIFlagArtificial)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !806, file: !2, baseType: !814, size: 128, align: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !798, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !792, file: !2, baseType: !832, size: 128, align: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !790, file: !2, size: 128, align: 64, elements: !833, templateParams: !796, identifier: "7b68bc08466d928637d7e7d57099489d")
!833 = !{!834}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !832, file: !2, baseType: !798, size: 128, align: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, scope: !790, file: !2, baseType: !211, size: 64, align: 64, flags: DIFlagArtificial)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !777, file: !2, baseType: !837, size: 128, align: 64, offset: 256)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !838, templateParams: !25, identifier: "8facd4a90e89fbfcefc3e77d0500b7df")
!838 = !{!839, !891}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !837, file: !2, baseType: !840, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64, align: 64, dwarfAddressSpace: 0)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !16, file: !2, size: 128, align: 64, elements: !842, templateParams: !25, identifier: "2c709190b109055c408d903fd280e28")
!842 = !{!843, !847}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !841, file: !2, baseType: !844, size: 64, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::{extern#0}::Opaque", baseType: !845, size: 64, align: 64, dwarfAddressSpace: 0)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !846, file: !2, align: 8, elements: !25, identifier: "7acc4079428b8fd5aa7429425a0f51bf")
!846 = !DINamespace(name: "{extern#0}", scope: !16)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !841, file: !2, baseType: !848, size: 64, align: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !849, size: 64, align: 64, dwarfAddressSpace: 0)
!849 = !DISubroutineType(types: !850)
!850 = !{!851, !844, !867}
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !182, file: !2, size: 8, align: 8, elements: !852, templateParams: !25, identifier: "928af09c499a8557723ab8613a45a2af")
!852 = !{!853}
!853 = !DICompositeType(tag: DW_TAG_variant_part, scope: !851, file: !2, size: 8, align: 8, elements: !854, templateParams: !25, identifier: "d740a99ca5d1b61f675b5713a2c99be1", discriminator: !866)
!854 = !{!855, !862}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !853, file: !2, baseType: !856, size: 8, align: 8, extraData: i64 0)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !851, file: !2, size: 8, align: 8, elements: !857, templateParams: !859, identifier: "6294464cb59571d9a4ee623306574936")
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !856, file: !2, baseType: !7, align: 8, offset: 8)
!859 = !{!191, !860}
!860 = !DITemplateTypeParameter(name: "E", type: !861)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !16, file: !2, align: 8, elements: !25, identifier: "bf3aef4f9504cfe3ac5791e1f2f63cb6")
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !853, file: !2, baseType: !863, size: 8, align: 8, extraData: i64 1)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !851, file: !2, size: 8, align: 8, elements: !864, templateParams: !859, identifier: "ed6dd7b34100f6e0a6c6258fd0ab63a9")
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !863, file: !2, baseType: !861, align: 8, offset: 8)
!866 = !DIDerivedType(tag: DW_TAG_member, scope: !851, file: !2, baseType: !103, size: 8, align: 8, flags: DIFlagArtificial)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !868, size: 64, align: 64, dwarfAddressSpace: 0)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !16, file: !2, size: 512, align: 64, elements: !869, templateParams: !25, identifier: "be5bb19fc932ab12521ea58cb41524f")
!869 = !{!870, !871, !872, !873, !885, !886}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !868, file: !2, baseType: !812, size: 32, align: 32, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !868, file: !2, baseType: !809, size: 32, align: 32, offset: 416)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !868, file: !2, baseType: !702, size: 8, align: 8, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !868, file: !2, baseType: !874, size: 128, align: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !304, file: !2, size: 128, align: 64, elements: !875, templateParams: !25, identifier: "578645c554b9926335f9609c234490f6")
!875 = !{!876}
!876 = !DICompositeType(tag: DW_TAG_variant_part, scope: !874, file: !2, size: 128, align: 64, elements: !877, templateParams: !25, identifier: "b4ca5065db7b85a108741b84384fb90", discriminator: !884)
!877 = !{!878, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !876, file: !2, baseType: !879, size: 128, align: 64, extraData: i64 0)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !874, file: !2, size: 128, align: 64, elements: !25, templateParams: !287, identifier: "465af204808870e2f0d1ac896441aac7")
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !876, file: !2, baseType: !881, size: 128, align: 64, extraData: i64 1)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !874, file: !2, size: 128, align: 64, elements: !882, templateParams: !287, identifier: "e8c132f01503d38149615a667e452cf2")
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !881, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, scope: !874, file: !2, baseType: !211, size: 64, align: 64, flags: DIFlagArtificial)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !868, file: !2, baseType: !874, size: 128, align: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !868, file: !2, baseType: !887, size: 128, align: 64, offset: 256)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !888, templateParams: !25, identifier: "6d2fb28423476875809fd2991d9a1f7c")
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !887, file: !2, baseType: !23, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !887, file: !2, baseType: !27, size: 64, align: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !837, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!777, !780, !837}
!894 = !{!774, !895}
!895 = !DILocalVariable(name: "args", arg: 2, scope: !775, file: !776, line: 383, type: !837)
!896 = !DILocation(line: 0, scope: !775, inlinedAt: !897)
!897 = distinct !DILocation(line: 13, column: 5, scope: !769)
!898 = !DILocation(line: 387, column: 9, scope: !775, inlinedAt: !897)
!899 = !{!900}
!900 = distinct !{!900, !901, !"_ZN4core3fmt9Arguments6new_v117h6e75abd41b7e726bE: argument 0"}
!901 = distinct !{!901, !"_ZN4core3fmt9Arguments6new_v117h6e75abd41b7e726bE"}
!902 = !{!903, !904}
!903 = distinct !{!903, !901, !"_ZN4core3fmt9Arguments6new_v117h6e75abd41b7e726bE: %pieces.0"}
!904 = distinct !{!904, !901, !"_ZN4core3fmt9Arguments6new_v117h6e75abd41b7e726bE: %args.0"}
!905 = !DILocation(line: 14, column: 2, scope: !769)
!906 = distinct !DISubprogram(name: "main", linkageName: "_ZN6rsmain4main17hc77cd4c1e7e61580E", scope: !771, file: !770, line: 17, type: !726, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized | DISPFlagMainSubprogram, unit: !699, templateParams: !25, retainedNodes: !25)
!907 = !{!"rsmain.19de4ef9-cgu.0:_ZN6rsmain4main17hc77cd4c1e7e61580E"}
!908 = !DILocation(line: 21, column: 9, scope: !906)
!909 = !DILocation(line: 21, column: 30, scope: !906)
!910 = !DILocation(line: 21, column: 51, scope: !906)
!911 = !DILocation(line: 0, scope: !775, inlinedAt: !912)
!912 = distinct !DILocation(line: 21, column: 9, scope: !906)
!913 = !DILocation(line: 387, column: 9, scope: !775, inlinedAt: !912)
!914 = !{!915}
!915 = distinct !{!915, !916, !"_ZN4core3fmt9Arguments6new_v117h6e75abd41b7e726bE: argument 0"}
!916 = distinct !{!916, !"_ZN4core3fmt9Arguments6new_v117h6e75abd41b7e726bE"}
!917 = !{!918, !919}
